backend/zalo_backend/test/load-tests/scenarios/basic-connection.yml
config:
  target: "http://localhost:8000"
  socketio:
    transports: ["websocket"]
    path: "/socket.io"
    auth:
      token: "{{ token }}"
  phases:
    - name: "Warm up"
      duration: 30
      arrivalRate: 5
      rampTo: 20
    - name: "Ramp to target load"
      duration: 60
      arrivalRate: 20
      rampTo: 100
    - name: "Sustained load"
      duration: 120
      arrivalRate: 100
    - name: "Peak load"
      duration: 60
      arrivalRate: 100
      rampTo: 200
    - name: "Cool down"
      duration: 30
      arrivalRate: 200
      rampTo: 0
  processor: "../processors/auth-processor.js"
  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  - name: "Basic Socket Connection"
    engine: "socketio"
    beforeScenario: "generateAuthToken"
    flow:
      # 1. Generate JWT token (via processor)
      
      # 2. Connect with authentication
      
      # 3. Wait for authentication confirmation
      - think: 1
      
      # 4. Listen for server heartbeat (30s interval from gateway)
      - loop:
          - think: 35
          - emit:
              channel: "client_pong"
              data:
                ts: "{{ $timestamp }}"
        count: 3