backend/zalo_backend/test/load-tests/scenarios/connection-churn.yml
config:
  target: "http://localhost:8000"
  socketio:
    transports: ["websocket"]
    path: "/socket.io"
  phases:
    - name: "Rapid connect/disconnect"
      duration: 180           # Chạy trong 3 phút
      arrivalRate: 50         # 50 user mới MỖI GIÂY (Thay thế cho việc reconnect thủ công)
  
  # Đã sửa đường dẫn processor cho đúng cấu trúc thư mục
  processor: "../processors/auth-processor.js"
  
  plugins:
    expect: {}

scenarios:
  # KỊCH BẢN 1: Vào rồi ra ngay (Churn) - Chiếm 70%
  - name: "Connection Churn"
    engine: "socketio"
    weight: 70
    flow:
      - function: "generateAuthToken"
      - function: "calculateChurnDelays"
      
      # 1. Connect: TỰ ĐỘNG (Không cần emit connect thủ công)
      # Chúng ta chỉ cần emit auth token để server xác thực
      - emit:
          channel: "authentication" # Hoặc event auth của bạn
          data:
            token: "{{ token }}"
      
      # Chờ authenticated (Nếu server có phản hồi)
      - think: 1 

      # 2. Giữ kết nối ngắn (Random 1-5s từ processor)
      - think: "{{ churnStay }}"
      
      # 3. Disconnect (Tự động kết thúc flow = Disconnect)
      # Server sẽ phải dọn dẹp ngay lập tức

  # KỊCH BẢN 2: Giả lập mạng lag (Unstable) - Chiếm 30%
  - name: "Unstable Connection"
    engine: "socketio"
    weight: 30
    flow:
      - function: "generateAuthToken"
      - function: "calculateUnstableDelays"
      
      # 1. Connect & Auth
      - emit:
          channel: "authentication"
          data:
            token: "{{ token }}"
      
      # 2. Giữ kết nối lâu hơn chút (Random 5-15s)
      - think: "{{ unstableStay }}"
      
      # 3. Disconnect
      # Lưu ý: Chúng ta không loop connect lại được.
      # Nhưng với arrivalRate=50, ngay khi user này thoát, user khác sẽ vào.
      # Điều này tạo ra hiệu ứng "nhấp nháy" liên tục trên server.