backend/zalo_backend/test/load-tests/scenarios/slow-client.yml
config:
  target: "http://localhost:8000"
  socketio:
    transports: ["websocket"]
    path: "/socket.io"
    # Simulate slow network
    reconnectionDelay: 1000
    reconnectionDelayMax: 5000
    timeout: 30000
    auth:
      token: "{{ token }}"
  phases:
    - name: "Slow clients arrive"
      duration: 120
      arrivalRate: 10
  processor: "../processors/auth-processor.js"
  plugins:
    expect: {}
scenarios:
  - name: "Slow Network Client (High Latency)"
    engine: "socketio"
    beforeScenario: "generateAuthToken"
    flow:
      # Simulate slow connection establishment
      - think: 5
      
      
      # Simulate slow processing (delayed ACKs)
      - loop:
          - think: 10 # 10 second delay between messages
          - emit:
              channel: "test:slow_message"
              data:
                content: "Slow client message"
                latency: "high"
                timestamp: "{{ $timestamp }}"
        count: 6
      
      # Remain idle for extended period (test TTL)
      - think: 180 # 3 minutes idle
      
      # Try to send message after idle period
      - emit:
          channel: "test:after_idle"
          data:
            content: "Am I still connected?"
      
      - think: 5

  - name: "Ping Timeout Simulation"
    engine: "socketio"
    beforeScenario: "generateAuthToken"
    flow:      
      # Don't respond to pings (simulate unresponsive client)
      # Server should disconnect after pingTimeout (20s)
      - think: 60
      
      # Connection should be dead by now
      # Artillery will log transport close error